Revit 2026 API

# TessellatedFace(IListIListXYZ, ElementId) Constructor

---

Initializes a new instance of the TessellatedFace class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TessellatedFace(
	IList<IList<XYZ>> allLoopVertices,
	ElementId materialId
)
```
```vb
Public Sub New (
	allLoopVertices As IList(Of IList(Of XYZ)),
	materialId As ElementId
)
```
```cpp
public:
TessellatedFace(
	IList<IList<XYZ^>^>^ allLoopVertices,
	ElementId^ materialId
)
```
```fsharp
new :
        allLoopVertices : IList<IList<XYZ>> *
        materialId : ElementId -> TessellatedFace
```

#### Parameters

allLoopVertices IListIListXYZ

materialId ElementId

#### Reference

TessellatedFace Class

TessellatedFace Overload

Autodesk.Revit.DB Namespace